> New code looks good, but this PR purports to resolve #4997 and I'm not convinced that it does. I believe that in order to create alarms for log forwarding failures, the `app.threshold`decorators need to be also added to the `forward_alb_logs` and `forward_s3_logs` handlers.

The log forwarding Lambda alarms don't show up in the [test on my deployment](https://github.com/DataBiosphere/azul/pull/5399#issuecomment-1636618738) since the log forwarding Lambdas are only enabled on main deployments.

With this PR, Lambda metric (Errors & Throttles) alarms will be created for all Lambdas on the deployment. Lambdas without explicit error or throttle thresholds from a `app.threshold` decorator will use a `0` [default threshold value](https://github.com/DataBiosphere/azul/blob/b3287b8b2bdfdf90cb2e5276e8d5b29075f2078a/src/azul/chalice.py#L506). 

<details>
<summary> Expand to see Terraform plan with `dev` deployment selected</summary>

```
Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.indexer_aggregate_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_aggregate_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_aggregate_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-aggregate"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_aggregate_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_aggregate_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_aggregate_retry_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_aggregate_retry_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_aggregate_retry_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-aggregate_retry"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_aggregate_retry_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_retry_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_aggregate_retry_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_retry_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_aggregate_retry_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_aggregate_retry_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_aggregate_retry_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-aggregate_retry"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_aggregate_retry_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_retry_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_aggregate_retry_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_retry_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_aggregate_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_aggregate_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_aggregate_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-aggregate"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_aggregate_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_aggregate_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_contribute_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_contribute_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_contribute_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-contribute"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_contribute_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_contribute_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_contribute_retry_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_contribute_retry_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_contribute_retry_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-contribute_retry"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_contribute_retry_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_retry_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_contribute_retry_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_retry_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_contribute_retry_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_contribute_retry_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_contribute_retry_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-contribute_retry"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_contribute_retry_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_retry_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_contribute_retry_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_retry_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_contribute_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_contribute_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_contribute_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-contribute"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_contribute_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_contribute_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_forward_alb_logs_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_forward_alb_logs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_forward_alb_logs_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-forward_alb_logs"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_forward_alb_logs_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_forward_alb_logs_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_forward_alb_logs_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_forward_alb_logs_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_forward_alb_logs_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_forward_alb_logs_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_forward_alb_logs_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-forward_alb_logs"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_forward_alb_logs_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_forward_alb_logs_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_forward_alb_logs_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_forward_alb_logs_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_forward_s3_logs_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_forward_s3_logs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_forward_s3_logs_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-forward_s3_logs"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_forward_s3_logs_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_forward_s3_logs_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_forward_s3_logs_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_forward_s3_logs_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_forward_s3_logs_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_forward_s3_logs_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_forward_s3_logs_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-forward_s3_logs"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_forward_s3_logs_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_forward_s3_logs_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_forward_s3_logs_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_forward_s3_logs_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_indexercachehealth_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_indexercachehealth_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_indexercachehealth_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-indexercachehealth"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_indexercachehealth_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_indexercachehealth_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_indexercachehealth_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_indexercachehealth_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_indexercachehealth_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_indexercachehealth_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_indexercachehealth_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev-indexercachehealth"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_indexercachehealth_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_indexercachehealth_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_indexercachehealth_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_indexercachehealth_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.indexer_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "indexer_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-indexer_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-indexer-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-indexer_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-indexer_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.service_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "service_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-service_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-service-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-service_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-service_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.service_manifest_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "service_manifest_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-service_manifest_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-service-dev-manifest"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-service_manifest_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_manifest_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-service_manifest_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_manifest_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.service_manifest_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "service_manifest_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-service_manifest_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-service-dev-manifest"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-service_manifest_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_manifest_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-service_manifest_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_manifest_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.service_servicecachehealth_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "service_servicecachehealth_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-service_servicecachehealth_errors-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-service-dev-servicecachehealth"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-service_servicecachehealth_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_servicecachehealth_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-service_servicecachehealth_errors-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_servicecachehealth_errors"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.service_servicecachehealth_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "service_servicecachehealth_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-service_servicecachehealth_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-service-dev-servicecachehealth"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-service_servicecachehealth_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_servicecachehealth_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-service_servicecachehealth_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_servicecachehealth_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.service_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "service_throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-service_throttles-dev.alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "FunctionName" = "azul-service-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-service_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-service_throttles-dev"
          + "billing"    = "hca"
          + "component"  = "azul-service_throttles"
          + "deployment" = "dev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

…

Plan: 23 to add, 11 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: no
```

</details>